---
kind: method
id: M:Autodesk.Revit.DB.PaperSizeSetIterator.#ctor
source: html/6060ba44-3b0c-fcdf-13bd-927691526165.htm
---
# Autodesk.Revit.DB.PaperSizeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public PaperSizeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.